garyPenhook/PIC-Assembler/edc/PIC18F26Q71.PIC
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="DMAnAIRQ" edc:desc="DMA abort trigger selection register" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="DMAnAIRQ" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-03034_dma_8bit_v1_overlaid.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x18" edc:_addr="0xFE">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="AIRQ" edc:mask="0xff" edc:name="AIRQ" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="AIRQ0" edc:mask="0x1" edc:name="AIRQ0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="AIRQ1" edc:mask="0x1" edc:name="AIRQ1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="AIRQ2" edc:mask="0x1" edc:name="AIRQ2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="AIRQ3" edc:mask="0x1" edc:name="AIRQ3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="AIRQ4" edc:mask="0x1" edc:name="AIRQ4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="AIRQ5" edc:mask="0x1" edc:name="AIRQ5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="AIRQ6" edc:mask="0x1" edc:name="AIRQ6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="AIRQ7" edc:mask="0x1" edc:name="AIRQ7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="DMAnSIRQ" edc:desc="DMA start trigger selection register" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="DMAnSIRQ" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-03034_dma_8bit_v1_overlaid.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x18" edc:_addr="0xFF">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SIRQ" edc:mask="0xff" edc:name="SIRQ" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="SIRQ0" edc:mask="0x1" edc:name="SIRQ0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SIRQ1" edc:mask="0x1" edc:name="SIRQ1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SIRQ2" edc:mask="0x1" edc:name="SIRQ2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SIRQ3" edc:mask="0x1" edc:name="SIRQ3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SIRQ4" edc:mask="0x1" edc:name="SIRQ4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SIRQ5" edc:mask="0x1" edc:name="SIRQ5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SIRQ6" edc:mask="0x1" edc:name="SIRQ6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SIRQ7" edc:mask="0x1" edc:name="SIRQ7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="0x1" edc:beginaddr="0x0100" edc:endaddr="0x0200" edc:regionid="sfr1">
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PORTW" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="PORTW" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-05249_io_vport_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xd" edc:_addr="0x100">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.1">
              <edc:SFRFieldDef edc:cname="RW0" edc:mask="0x1" edc:name="RW0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RW1" edc:mask="0x1" edc:name="RW1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RW2" edc:mask="0x1" edc:name="RW2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RW3" edc:mask="0x1" edc:name="RW3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RW4" edc:mask="0x1" edc:name="RW4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RW5" edc:mask="0x1" edc:name="RW5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RW6" edc:mask="0x1" edc:name="RW6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RW7" edc:mask="0x1" edc:name="RW7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="LATW" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="LATW" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-05249_io_vport_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xd" edc:_addr="0x101">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="LATW0" edc:mask="0x1" edc:name="LATW0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATW1" edc:mask="0x1" edc:name="LATW1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATW2" edc:mask="0x1" edc:name="LATW2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATW3" edc:mask="0x1" edc:name="LATW3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATW4" edc:mask="0x1" edc:name="LATW4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATW5" edc:mask="0x1" edc:name="LATW5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATW6" edc:mask="0x1" edc:name="LATW6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATW7" edc:mask="0x1" edc:name="LATW7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="----nnnn" edc:cname="PORTWIN0" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----0000" edc:name="PORTWIN0" edc:nzwidth="8" edc:por="----0000" edc:_modsrc="DOS-05249_io_vport_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xd" edc:_addr="0x102">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="IN" edc:mask="0xf" edc:name="IN" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="IN0" edc:mask="0x1" edc:name="IN0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IN1" edc:mask="0x1" edc:name="IN1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IN2" edc:mask="0x1" edc:name="IN2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IN3" edc:mask="0x1" edc:name="IN3" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="----nnnn" edc:cname="PORTWIN1" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----0000" edc:name="PORTWIN1" edc:nzwidth="8" edc:por="----0000" edc:_modsrc="DOS-05249_io_vport_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xd" edc:_addr="0x103">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="IN" edc:mask="0xf" edc:name="IN" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="IN0" edc:mask="0x1" edc:name="IN0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IN1" edc:mask="0x1" edc:name="IN1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IN2" edc:mask="0x1" edc:name="IN2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IN3" edc:mask="0x1" edc:name="IN3" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="----nnnn" edc:cname="PORTWIN2" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----0000" edc:name="PORTWIN2" edc:nzwidth="8" edc:por="----0000" edc:_modsrc="DOS-05249_io_vport_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xd" edc:_addr="0x104">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="IN" edc:mask="0xf" edc:name="IN" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="IN0" edc:mask="0x1" edc:name="IN0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IN1" edc:mask="0x1" edc:name="IN1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IN2" edc:mask="0x1" edc:name="IN2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IN3" edc:mask="0x1" edc:name="IN3" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="----nnnn" edc:cname="PORTWIN3" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----0000" edc:name="PORTWIN3" edc:nzwidth="8" edc:por="----0000" edc:_modsrc="DOS-05249_io_vport_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xd" edc:_addr="0x105">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="IN" edc:mask="0xf" edc:name="IN" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="IN0" edc:mask="0x1" edc:name="IN0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IN1" edc:mask="0x1" edc:name="IN1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IN2" edc:mask="0x1" edc:name="IN2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IN3" edc:mask="0x1" edc:name="IN3" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
