garyPenhook/PIC-Assembler/edc/PIC18F26Q71.PIC
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="I2C1ADB0" edc:desc="I2C ADDRESS BUFFER  REGISTER 0" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="I2C1ADB0" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-04803_i2c_8bit_v5.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x17" edc:_addr="0x28D">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ADB" edc:mask="0xff" edc:name="ADB" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="I2C1ADB1" edc:desc="I2C ADDRESS BUFFER  REGISTER 1" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="I2C1ADB1" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-04803_i2c_8bit_v5.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x17" edc:_addr="0x28E">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ADB" edc:mask="0xff" edc:name="ADB" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="I2C1ADR0" edc:desc="I2C ADDRESS REGISTER 0" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="11111111" edc:name="I2C1ADR0" edc:nzwidth="8" edc:por="11111111" edc:_modsrc="DOS-04803_i2c_8bit_v5.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x17" edc:_addr="0x28F">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ADR" edc:mask="0xff" edc:name="ADR" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnn-" edc:cname="I2C1ADR1" edc:desc="I2C ADDRESS REGISTER 1" edc:impl="0xfe" edc:isindirect="false" edc:isvolatile="true" edc:mclr="11111110" edc:name="I2C1ADR1" edc:nzwidth="8" edc:por="11111110" edc:_modsrc="DOS-04803_i2c_8bit_v5.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x17" edc:_addr="0x290">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="ADR" edc:mask="0x7f" edc:name="ADR" edc:nzwidth="0x7"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="I2C1ADR2" edc:desc="I2C ADDRESS REGISTER 2" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="11111111" edc:name="I2C1ADR2" edc:nzwidth="8" edc:por="11111111" edc:_modsrc="DOS-04803_i2c_8bit_v5.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x17" edc:_addr="0x291">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ADR" edc:mask="0xff" edc:name="ADR" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnn-" edc:cname="I2C1ADR3" edc:desc="I2C ADDRESS REGISTER 3" edc:impl="0xfe" edc:isindirect="false" edc:isvolatile="true" edc:mclr="11111110" edc:name="I2C1ADR3" edc:nzwidth="8" edc:por="11111110" edc:_modsrc="DOS-04803_i2c_8bit_v5.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x17" edc:_addr="0x292">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="ADR" edc:mask="0x7f" edc:name="ADR" edc:nzwidth="0x7"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnscrnnn" edc:cname="I2C1CON0" edc:desc="I2C CONTROL REGISTER 0" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="I2C1CON0" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-04803_i2c_8bit_v5.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x17" edc:_addr="0x293">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="MODE" edc:mask="0x7" edc:name="MODE" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="MDR" edc:mask="0x1" edc:name="MDR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CSTR" edc:mask="0x1" edc:name="CSTR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="S" edc:mask="0x1" edc:name="S" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RSEN" edc:mask="0x1" edc:name="RSEN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EN" edc:mask="0x1" edc:name="EN" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="MODE0" edc:mask="0x1" edc:name="MODE0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="MODE1" edc:mask="0x1" edc:name="MODE1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="MODE2" edc:mask="0x1" edc:name="MODE2" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x4"/>
              <edc:SFRFieldDef edc:cname="I2CEN" edc:mask="0x1" edc:name="I2CEN" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnrrsnnn" edc:cname="I2C1CON1" edc:desc="I2C CONTROL REGISTER 1" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="I2C1CON1" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-04803_i2c_8bit_v5.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x17" edc:_addr="0x294">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CSD" edc:mask="0x1" edc:name="CSD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXU" edc:mask="0x1" edc:name="TXU" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXO" edc:mask="0x1" edc:name="RXO" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="P" edc:mask="0x1" edc:name="P" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ACKT" edc:mask="0x1" edc:name="ACKT" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ACKSTAT" edc:mask="0x1" edc:name="ACKSTAT" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ACKDT" edc:mask="0x1" edc:name="ACKDT" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ACKCNT" edc:mask="0x1" edc:name="ACKCNT" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nn-nnnnn" edc:cname="I2C1CON2" edc:desc="I2C CONTROL REGISTER 2" edc:impl="0xdf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00-00000" edc:name="I2C1CON2" edc:nzwidth="8" edc:por="00-00000" edc:_modsrc="DOS-04803_i2c_8bit_v5.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x17" edc:_addr="0x295">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="BFRET" edc:mask="0x3" edc:name="BFRET" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="SDAHT" edc:mask="0x3" edc:name="SDAHT" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="ABD" edc:mask="0x1" edc:name="ABD" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="GCEN" edc:mask="0x1" edc:name="GCEN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ACNT" edc:mask="0x1" edc:name="ACNT" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="BFRET0" edc:mask="0x1" edc:name="BFRET0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="BFRET1" edc:mask="0x1" edc:name="BFRET1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SDAHT0" edc:mask="0x1" edc:name="SDAHT0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SDAHT1" edc:mask="0x1" edc:name="SDAHT1" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="----nnnn" edc:cname="I2C1CON3" edc:desc="I2C CONTROL REGISTER 3" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----0000" edc:name="I2C1CON3" edc:nzwidth="8" edc:por="----0000" edc:_modsrc="DOS-04803_i2c_8bit_v5.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x17" edc:_addr="0x296">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ACNTMD" edc:mask="0x3" edc:name="ACNTMD" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="FME" edc:mask="0x3" edc:name="FME" edc:nzwidth="0x2"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="ACNTMD0" edc:mask="0x1" edc:name="ACNTMD0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ACNTMD1" edc:mask="0x1" edc:name="ACNTMD1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FME0" edc:mask="0x1" edc:name="FME0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FME1" edc:mask="0x1" edc:name="FME1" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
