garyPenhook/PIC-Assembler/edc/PIC18F26Q71.PIC
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="TU16BPRH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="TU16BPRH" edc:nzwidth="8" edc:por="11111111" edc:_modsrc="DOS-03877_tmr_8bit_v1_16bits.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0xa" edc:_addr="0x3B1">
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="PRH" edc:mask="0xff" edc:name="PRH" edc:nzwidth="0x8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="PRH0" edc:mask="0x1" edc:name="PRH0" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PRH1" edc:mask="0x1" edc:name="PRH1" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PRH2" edc:mask="0x1" edc:name="PRH2" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PRH3" edc:mask="0x1" edc:name="PRH3" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PRH4" edc:mask="0x1" edc:name="PRH4" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PRH5" edc:mask="0x1" edc:name="PRH5" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PRH6" edc:mask="0x1" edc:name="PRH6" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PRH7" edc:mask="0x1" edc:name="PRH7" edc:nzwidth="0x1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="TU16BPRH0" edc:mask="0x1" edc:name="TU16BPRH0" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="TU16BPRH1" edc:mask="0x1" edc:name="TU16BPRH1" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="TU16BPRH2" edc:mask="0x1" edc:name="TU16BPRH2" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="TU16BPRH3" edc:mask="0x1" edc:name="TU16BPRH3" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="TU16BPRH4" edc:mask="0x1" edc:name="TU16BPRH4" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="TU16BPRH5" edc:mask="0x1" edc:name="TU16BPRH5" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="TU16BPRH6" edc:mask="0x1" edc:name="TU16BPRH6" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="TU16BPRH7" edc:mask="0x1" edc:name="TU16BPRH7" edc:nzwidth="0x1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.2">
                <edc:SFRFieldDef edc:cname="TU16BPR8" edc:mask="0x1" edc:name="TU16BPR8" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="TU16BPR9" edc:mask="0x1" edc:name="TU16BPR9" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="TU16BPR10" edc:mask="0x1" edc:name="TU16BPR10" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="TU16BPR11" edc:mask="0x1" edc:name="TU16BPR11" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="TU16BPR12" edc:mask="0x1" edc:name="TU16BPR12" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="TU16BPR13" edc:mask="0x1" edc:name="TU16BPR13" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="TU16BPR14" edc:mask="0x1" edc:name="TU16BPR14" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="TU16BPR15" edc:mask="0x1" edc:name="TU16BPR15" edc:nzwidth="0x1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="TU16BCLK" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="TU16BCLK" edc:nzwidth="8" edc:por="---00000" edc:_modsrc="DOS-03877_tmr_8bit_v1_16bits.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0xa" edc:_addr="0x3B2">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CLK" edc:mask="0x1f" edc:name="CLK" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="CLK0" edc:mask="0x1" edc:name="CLK0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLK1" edc:mask="0x1" edc:name="CLK1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLK2" edc:mask="0x1" edc:name="CLK2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLK3" edc:mask="0x1" edc:name="CLK3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLK4" edc:mask="0x1" edc:name="CLK4" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="TU16BCLK0" edc:mask="0x1" edc:name="TU16BCLK0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TU16BCLK1" edc:mask="0x1" edc:name="TU16BCLK1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TU16BCLK2" edc:mask="0x1" edc:name="TU16BCLK2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TU16BCLK3" edc:mask="0x1" edc:name="TU16BCLK3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TU16BCLK4" edc:mask="0x1" edc:name="TU16BCLK4" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="TU16BERS" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="TU16BERS" edc:nzwidth="8" edc:por="---00000" edc:_modsrc="DOS-03877_tmr_8bit_v1_16bits.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0xa" edc:_addr="0x3B3">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ERS" edc:mask="0x1f" edc:name="ERS" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="ERS0" edc:mask="0x1" edc:name="ERS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ERS1" edc:mask="0x1" edc:name="ERS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ERS2" edc:mask="0x1" edc:name="ERS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ERS3" edc:mask="0x1" edc:name="ERS3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ERS4" edc:mask="0x1" edc:name="ERS4" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="TU16BERS0" edc:mask="0x1" edc:name="TU16BERS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TU16BERS1" edc:mask="0x1" edc:name="TU16BERS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TU16BERS2" edc:mask="0x1" edc:name="TU16BERS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TU16BERS3" edc:mask="0x1" edc:name="TU16BERS3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TU16BERS4" edc:mask="0x1" edc:name="TU16BERS4" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-------n" edc:cname="TUCHAIN" edc:desc="" edc:impl="0x1" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-------u" edc:name="TUCHAIN" edc:nzwidth="8" edc:por="-------x" edc:_addr="0x3B4">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CH16AB" edc:mask="0x1" edc:name="CH16AB" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
