garyPenhook/PIC-Assembler/edc/PIC18F26Q71.PIC
        <edc:SFRDef edc:access="rrrrrrrrrrrrrrrr" edc:cname="TMR3_Internal" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="false" edc:mclr="uuuuuuuuuuuuuuuu" edc:name="TMR3_Internal" edc:nzwidth="0x10" edc:por="xxxxxxxxxxxxxxxx" edc:nmmrid="14">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="InternalTMR" edc:desc="" edc:mask="0xffff" edc:name="InternalTMR" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="TMR3_Prescale" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="false" edc:mclr="uuuuuuuu" edc:name="TMR3_Prescale" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:nmmrid="21">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="InternalPS" edc:desc="" edc:mask="0xff" edc:name="InternalPS" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
      </edc:NMMRPlace>
      <edc:EmulatorZone edc:beginaddr="0x0000" edc:endaddr="0x0038" edc:regionid="emulatorzone"/>
    </edc:RegardlessOfMode>
    <edc:TraditionalModeOnly>
      <edc:GPRDataSector edc:beginaddr="0x0500" edc:endaddr="0x0560" edc:regionid="accessram"/>
    </edc:TraditionalModeOnly>
    <edc:ExtendedModeOnly>
      <edc:GPRDataSector edc:bank="5" edc:beginaddr="0x0500" edc:endaddr="0x0560" edc:regionid="gpre"/>
    </edc:ExtendedModeOnly>
  </edc:DataSpace>
  <edc:DMASpace>
    <edc:SFRDataSector edc:beginaddr="0x4000" edc:endaddr="0x4100" edc:regionid="sfr64">
      <edc:RegisterMirror edc:cnameref="CCPR1L" edc:cnamesuffix="M1"/>
      <edc:RegisterMirror edc:cnameref="CCPR1H" edc:cnamesuffix="M1"/>
      <edc:RegisterMirror edc:cnameref="CCPR2L" edc:cnamesuffix="M1"/>
      <edc:RegisterMirror edc:cnameref="CCPR2H" edc:cnamesuffix="M1"/>
      <edc:AdjustPoint edc:offset="0x02"/>
      <edc:RegisterMirror edc:cnameref="PWM1S1P1L" edc:cnamesuffix="M1"/>
      <edc:RegisterMirror edc:cnameref="PWM1S1P1H" edc:cnamesuffix="M1"/>
      <edc:RegisterMirror edc:cnameref="PWM2S1P1L" edc:cnamesuffix="M1"/>
      <edc:RegisterMirror edc:cnameref="PWM2S1P1H" edc:cnamesuffix="M1"/>
      <edc:RegisterMirror edc:cnameref="PWM3S1P1L" edc:cnamesuffix="M1"/>
      <edc:RegisterMirror edc:cnameref="PWM3S1P1H" edc:cnamesuffix="M1"/>
      <edc:AdjustPoint edc:offset="0x04"/>
      <edc:RegisterMirror edc:cnameref="PWM1S1P1L" edc:cnamesuffix="M2"/>
      <edc:RegisterMirror edc:cnameref="PWM1S1P1H" edc:cnamesuffix="M2"/>
      <edc:RegisterMirror edc:cnameref="PWM1S1P2L" edc:cnamesuffix="M1"/>
      <edc:RegisterMirror edc:cnameref="PWM1S1P2H" edc:cnamesuffix="M1"/>
      <edc:RegisterMirror edc:cnameref="PWM2S1P1L" edc:cnamesuffix="M2"/>
      <edc:RegisterMirror edc:cnameref="PWM2S1P1H" edc:cnamesuffix="M2"/>
      <edc:RegisterMirror edc:cnameref="PWM2S1P2L" edc:cnamesuffix="M1"/>
      <edc:RegisterMirror edc:cnameref="PWM2S1P2H" edc:cnamesuffix="M1"/>
      <edc:RegisterMirror edc:cnameref="PWM3S1P1L" edc:cnamesuffix="M2"/>
      <edc:RegisterMirror edc:cnameref="PWM3S1P1H" edc:cnamesuffix="M2"/>
      <edc:RegisterMirror edc:cnameref="PWM3S1P2L" edc:cnamesuffix="M1"/>
      <edc:RegisterMirror edc:cnameref="PWM3S1P2H" edc:cnamesuffix="M1"/>
      <edc:AdjustPoint edc:offset="0x04"/>
      <edc:RegisterMirror edc:cnameref="PWM1S1P1L" edc:cnamesuffix="M3"/>
      <edc:RegisterMirror edc:cnameref="PWM1S1P1H" edc:cnamesuffix="M3"/>
      <edc:RegisterMirror edc:cnameref="PWM1S1P2L" edc:cnamesuffix="M2"/>
      <edc:RegisterMirror edc:cnameref="PWM1S1P2H" edc:cnamesuffix="M2"/>
      <edc:RegisterMirror edc:cnameref="PWM1PRL" edc:cnamesuffix="M1"/>
      <edc:RegisterMirror edc:cnameref="PWM1PRH" edc:cnamesuffix="M1"/>
      <edc:RegisterMirror edc:cnameref="PWM2S1P1L" edc:cnamesuffix="M3"/>
      <edc:RegisterMirror edc:cnameref="PWM2S1P1H" edc:cnamesuffix="M3"/>
      <edc:RegisterMirror edc:cnameref="PWM2S1P2L" edc:cnamesuffix="M2"/>
      <edc:RegisterMirror edc:cnameref="PWM2S1P2H" edc:cnamesuffix="M2"/>
      <edc:RegisterMirror edc:cnameref="PWM2PRL" edc:cnamesuffix="M1"/>
      <edc:RegisterMirror edc:cnameref="PWM2PRH" edc:cnamesuffix="M1"/>
      <edc:RegisterMirror edc:cnameref="PWM3S1P1L" edc:cnamesuffix="M3"/>
      <edc:RegisterMirror edc:cnameref="PWM3S1P1H" edc:cnamesuffix="M3"/>
      <edc:RegisterMirror edc:cnameref="PWM3S1P2L" edc:cnamesuffix="M2"/>
      <edc:RegisterMirror edc:cnameref="PWM3S1P2H" edc:cnamesuffix="M2"/>
      <edc:RegisterMirror edc:cnameref="PWM3PRL" edc:cnamesuffix="M1"/>
      <edc:RegisterMirror edc:cnameref="PWM3PRH" edc:cnamesuffix="M1"/>
      <edc:AdjustPoint edc:offset="0x0E"/>
      <edc:RegisterMirror edc:cnameref="CCPR1L" edc:cnamesuffix="M2"/>
      <edc:RegisterMirror edc:cnameref="CCPR1H" edc:cnamesuffix="M2"/>
      <edc:RegisterMirror edc:cnameref="T2PR" edc:cnamesuffix="M1"/>
      <edc:RegisterMirror edc:cnameref="CCPR2L" edc:cnamesuffix="M2"/>
      <edc:RegisterMirror edc:cnameref="CCPR2H" edc:cnamesuffix="M2"/>
      <edc:RegisterMirror edc:cnameref="T4PR" edc:cnamesuffix="M1"/>
      <edc:AdjustPoint edc:offset="0x1A"/>
      <edc:RegisterMirror edc:cnameref="ADLTHL" edc:cnamesuffix="CX1"/>
      <edc:RegisterMirror edc:cnameref="ADLTHH" edc:cnamesuffix="CX1"/>
      <edc:RegisterMirror edc:cnameref="ADUTHL" edc:cnamesuffix="CX1"/>
      <edc:RegisterMirror edc:cnameref="ADUTHH" edc:cnamesuffix="CX1"/>
      <edc:RegisterMirror edc:cnameref="ADERRL" edc:cnamesuffix="CX1"/>
      <edc:RegisterMirror edc:cnameref="ADERRH" edc:cnamesuffix="CX1"/>
      <edc:RegisterMirror edc:cnameref="ADSTPTL" edc:cnamesuffix="CX1"/>
      <edc:RegisterMirror edc:cnameref="ADSTPTH" edc:cnamesuffix="CX1"/>
      <edc:RegisterMirror edc:cnameref="ADFLTRL" edc:cnamesuffix="CX1"/>
      <edc:RegisterMirror edc:cnameref="ADFLTRH" edc:cnamesuffix="CX1"/>
      <edc:RegisterMirror edc:cnameref="ADACCL" edc:cnamesuffix="CX1"/>
      <edc:RegisterMirror edc:cnameref="ADACCH" edc:cnamesuffix="CX1"/>
      <edc:RegisterMirror edc:cnameref="ADACCU" edc:cnamesuffix="CX1"/>
      <edc:RegisterMirror edc:cnameref="ADCNT" edc:cnamesuffix="CX1"/>
      <edc:RegisterMirror edc:cnameref="ADRPT" edc:cnamesuffix="CX1"/>
      <edc:RegisterMirror edc:cnameref="ADPREVL" edc:cnamesuffix="CX1"/>
      <edc:RegisterMirror edc:cnameref="ADPREVH" edc:cnamesuffix="CX1"/>
      <edc:RegisterMirror edc:cnameref="ADACQL" edc:cnamesuffix="CX1"/>
      <edc:RegisterMirror edc:cnameref="ADACQH" edc:cnamesuffix="CX1"/>
      <edc:RegisterMirror edc:cnameref="ADCAP" edc:cnamesuffix="CX1"/>
      <edc:RegisterMirror edc:cnameref="ADCON0" edc:cnamesuffix="CX1"/>
      <edc:RegisterMirror edc:cnameref="ADCON1" edc:cnamesuffix="CX1"/>
      <edc:RegisterMirror edc:cnameref="ADCON2" edc:cnamesuffix="CX1"/>
      <edc:RegisterMirror edc:cnameref="ADCON3" edc:cnamesuffix="CX1"/>
      <edc:RegisterMirror edc:cnameref="ADREF" edc:cnamesuffix="CX1"/>
      <edc:RegisterMirror edc:cnameref="ADACT" edc:cnamesuffix="CX1"/>
      <edc:RegisterMirror edc:cnameref="ADCLK" edc:cnamesuffix="CX1"/>
      <edc:RegisterMirror edc:cnameref="ADPCH" edc:cnamesuffix="CX1"/>
      <edc:RegisterMirror edc:cnameref="ADNCH" edc:cnamesuffix="CX1"/>
      <edc:RegisterMirror edc:cnameref="ADRESL" edc:cnamesuffix="CX1"/>
      <edc:RegisterMirror edc:cnameref="ADRESH" edc:cnamesuffix="CX1"/>
      <edc:RegisterMirror edc:cnameref="ADPREL" edc:cnamesuffix="CX1"/>
      <edc:RegisterMirror edc:cnameref="ADPREH" edc:cnamesuffix="CX1"/>
      <edc:RegisterMirror edc:cnameref="ADLTHL" edc:cnamesuffix="CX2"/>
      <edc:RegisterMirror edc:cnameref="ADLTHH" edc:cnamesuffix="CX2"/>
      <edc:RegisterMirror edc:cnameref="ADUTHL" edc:cnamesuffix="CX2"/>
      <edc:RegisterMirror edc:cnameref="ADUTHH" edc:cnamesuffix="CX2"/>
      <edc:RegisterMirror edc:cnameref="ADERRL" edc:cnamesuffix="CX2"/>
      <edc:RegisterMirror edc:cnameref="ADERRH" edc:cnamesuffix="CX2"/>
      <edc:RegisterMirror edc:cnameref="ADSTPTL" edc:cnamesuffix="CX2"/>
      <edc:RegisterMirror edc:cnameref="ADSTPTH" edc:cnamesuffix="CX2"/>
      <edc:RegisterMirror edc:cnameref="ADFLTRL" edc:cnamesuffix="CX2"/>
      <edc:RegisterMirror edc:cnameref="ADFLTRH" edc:cnamesuffix="CX2"/>
      <edc:RegisterMirror edc:cnameref="ADACCL" edc:cnamesuffix="CX2"/>
      <edc:RegisterMirror edc:cnameref="ADACCH" edc:cnamesuffix="CX2"/>
      <edc:RegisterMirror edc:cnameref="ADACCU" edc:cnamesuffix="CX2"/>
      <edc:RegisterMirror edc:cnameref="ADCNT" edc:cnamesuffix="CX2"/>
      <edc:RegisterMirror edc:cnameref="ADRPT" edc:cnamesuffix="CX2"/>
      <edc:RegisterMirror edc:cnameref="ADPREVL" edc:cnamesuffix="CX2"/>
      <edc:RegisterMirror edc:cnameref="ADPREVH" edc:cnamesuffix="CX2"/>
      <edc:RegisterMirror edc:cnameref="ADACQL" edc:cnamesuffix="CX2"/>
      <edc:RegisterMirror edc:cnameref="ADACQH" edc:cnamesuffix="CX2"/>
      <edc:RegisterMirror edc:cnameref="ADCAP" edc:cnamesuffix="CX2"/>
      <edc:RegisterMirror edc:cnameref="ADCON0" edc:cnamesuffix="CX2"/>
      <edc:RegisterMirror edc:cnameref="ADCON1" edc:cnamesuffix="CX2"/>
      <edc:RegisterMirror edc:cnameref="ADCON2" edc:cnamesuffix="CX2"/>
      <edc:RegisterMirror edc:cnameref="ADCON3" edc:cnamesuffix="CX2"/>
      <edc:RegisterMirror edc:cnameref="ADREF" edc:cnamesuffix="CX2"/>
      <edc:RegisterMirror edc:cnameref="ADACT" edc:cnamesuffix="CX2"/>
      <edc:RegisterMirror edc:cnameref="ADCLK" edc:cnamesuffix="CX2"/>
      <edc:RegisterMirror edc:cnameref="ADPCH" edc:cnamesuffix="CX2"/>
      <edc:RegisterMirror edc:cnameref="ADNCH" edc:cnamesuffix="CX2"/>
      <edc:RegisterMirror edc:cnameref="ADRESL" edc:cnamesuffix="CX2"/>
      <edc:RegisterMirror edc:cnameref="ADRESH" edc:cnamesuffix="CX2"/>
      <edc:RegisterMirror edc:cnameref="ADPREL" edc:cnamesuffix="CX2"/>
      <edc:RegisterMirror edc:cnameref="ADPREH" edc:cnamesuffix="CX2"/>
      <edc:RegisterMirror edc:cnameref="ADLTHL" edc:cnamesuffix="CX3"/>
      <edc:RegisterMirror edc:cnameref="ADLTHH" edc:cnamesuffix="CX3"/>
      <edc:RegisterMirror edc:cnameref="ADUTHL" edc:cnamesuffix="CX3"/>
      <edc:RegisterMirror edc:cnameref="ADUTHH" edc:cnamesuffix="CX3"/>
      <edc:RegisterMirror edc:cnameref="ADERRL" edc:cnamesuffix="CX3"/>
      <edc:RegisterMirror edc:cnameref="ADERRH" edc:cnamesuffix="CX3"/>
      <edc:RegisterMirror edc:cnameref="ADSTPTL" edc:cnamesuffix="CX3"/>
      <edc:RegisterMirror edc:cnameref="ADSTPTH" edc:cnamesuffix="CX3"/>
      <edc:RegisterMirror edc:cnameref="ADFLTRL" edc:cnamesuffix="CX3"/>
      <edc:RegisterMirror edc:cnameref="ADFLTRH" edc:cnamesuffix="CX3"/>
      <edc:RegisterMirror edc:cnameref="ADACCL" edc:cnamesuffix="CX3"/>
      <edc:RegisterMirror edc:cnameref="ADACCH" edc:cnamesuffix="CX3"/>
      <edc:RegisterMirror edc:cnameref="ADACCU" edc:cnamesuffix="CX3"/>
      <edc:RegisterMirror edc:cnameref="ADCNT" edc:cnamesuffix="CX3"/>
      <edc:RegisterMirror edc:cnameref="ADRPT" edc:cnamesuffix="CX3"/>
      <edc:RegisterMirror edc:cnameref="ADPREVL" edc:cnamesuffix="CX3"/>
      <edc:RegisterMirror edc:cnameref="ADPREVH" edc:cnamesuffix="CX3"/>
      <edc:RegisterMirror edc:cnameref="ADACQL" edc:cnamesuffix="CX3"/>
      <edc:RegisterMirror edc:cnameref="ADACQH" edc:cnamesuffix="CX3"/>
      <edc:RegisterMirror edc:cnameref="ADCAP" edc:cnamesuffix="CX3"/>
      <edc:RegisterMirror edc:cnameref="ADCON0" edc:cnamesuffix="CX3"/>
      <edc:RegisterMirror edc:cnameref="ADCON1" edc:cnamesuffix="CX3"/>
      <edc:RegisterMirror edc:cnameref="ADCON2" edc:cnamesuffix="CX3"/>
      <edc:RegisterMirror edc:cnameref="ADCON3" edc:cnamesuffix="CX3"/>
      <edc:RegisterMirror edc:cnameref="ADREF" edc:cnamesuffix="CX3"/>
      <edc:RegisterMirror edc:cnameref="ADACT" edc:cnamesuffix="CX3"/>
      <edc:RegisterMirror edc:cnameref="ADCLK" edc:cnamesuffix="CX3"/>
      <edc:RegisterMirror edc:cnameref="ADPCH" edc:cnamesuffix="CX3"/>
      <edc:RegisterMirror edc:cnameref="ADNCH" edc:cnamesuffix="CX3"/>
      <edc:RegisterMirror edc:cnameref="ADRESL" edc:cnamesuffix="CX3"/>
      <edc:RegisterMirror edc:cnameref="ADRESH" edc:cnamesuffix="CX3"/>
      <edc:RegisterMirror edc:cnameref="ADPREL" edc:cnamesuffix="CX3"/>
      <edc:RegisterMirror edc:cnameref="ADPREH" edc:cnamesuffix="CX3"/>
      <edc:RegisterMirror edc:cnameref="ADLTHL" edc:cnamesuffix="CX4"/>
      <edc:RegisterMirror edc:cnameref="ADLTHH" edc:cnamesuffix="CX4"/>
      <edc:RegisterMirror edc:cnameref="ADUTHL" edc:cnamesuffix="CX4"/>
      <edc:RegisterMirror edc:cnameref="ADUTHH" edc:cnamesuffix="CX4"/>
      <edc:RegisterMirror edc:cnameref="ADERRL" edc:cnamesuffix="CX4"/>
      <edc:RegisterMirror edc:cnameref="ADERRH" edc:cnamesuffix="CX4"/>
      <edc:RegisterMirror edc:cnameref="ADSTPTL" edc:cnamesuffix="CX4"/>
      <edc:RegisterMirror edc:cnameref="ADSTPTH" edc:cnamesuffix="CX4"/>
      <edc:RegisterMirror edc:cnameref="ADFLTRL" edc:cnamesuffix="CX4"/>
      <edc:RegisterMirror edc:cnameref="ADFLTRH" edc:cnamesuffix="CX4"/>
      <edc:RegisterMirror edc:cnameref="ADACCL" edc:cnamesuffix="CX4"/>
      <edc:RegisterMirror edc:cnameref="ADACCH" edc:cnamesuffix="CX4"/>
      <edc:RegisterMirror edc:cnameref="ADACCU" edc:cnamesuffix="CX4"/>
      <edc:RegisterMirror edc:cnameref="ADCNT" edc:cnamesuffix="CX4"/>
      <edc:RegisterMirror edc:cnameref="ADRPT" edc:cnamesuffix="CX4"/>
      <edc:RegisterMirror edc:cnameref="ADPREVL" edc:cnamesuffix="CX4"/>
      <edc:RegisterMirror edc:cnameref="ADPREVH" edc:cnamesuffix="CX4"/>
      <edc:RegisterMirror edc:cnameref="ADACQL" edc:cnamesuffix="CX4"/>
      <edc:RegisterMirror edc:cnameref="ADACQH" edc:cnamesuffix="CX4"/>
      <edc:RegisterMirror edc:cnameref="ADCAP" edc:cnamesuffix="CX4"/>
      <edc:RegisterMirror edc:cnameref="ADCON0" edc:cnamesuffix="CX4"/>
      <edc:RegisterMirror edc:cnameref="ADCON1" edc:cnamesuffix="CX4"/>
      <edc:RegisterMirror edc:cnameref="ADCON2" edc:cnamesuffix="CX4"/>
      <edc:RegisterMirror edc:cnameref="ADCON3" edc:cnamesuffix="CX4"/>
      <edc:RegisterMirror edc:cnameref="ADREF" edc:cnamesuffix="CX4"/>
      <edc:RegisterMirror edc:cnameref="ADACT" edc:cnamesuffix="CX4"/>
      <edc:RegisterMirror edc:cnameref="ADCLK" edc:cnamesuffix="CX4"/>
      <edc:RegisterMirror edc:cnameref="ADPCH" edc:cnamesuffix="CX4"/>
      <edc:RegisterMirror edc:cnameref="ADNCH" edc:cnamesuffix="CX4"/>
      <edc:RegisterMirror edc:cnameref="ADRESL" edc:cnamesuffix="CX4"/>
      <edc:RegisterMirror edc:cnameref="ADRESH" edc:cnamesuffix="CX4"/>
      <edc:RegisterMirror edc:cnameref="ADPREL" edc:cnamesuffix="CX4"/>
      <edc:RegisterMirror edc:cnameref="ADPREH" edc:cnamesuffix="CX4"/>
      <edc:RegisterMirror edc:cnameref="ADLTHL" edc:cnamesuffix="M1"/>
      <edc:RegisterMirror edc:cnameref="ADLTHH" edc:cnamesuffix="M1"/>
      <edc:RegisterMirror edc:cnameref="ADUTHL" edc:cnamesuffix="M1"/>
      <edc:RegisterMirror edc:cnameref="ADUTHH" edc:cnamesuffix="M1"/>
      <edc:RegisterMirror edc:cnameref="ADERRL" edc:cnamesuffix="M1"/>
      <edc:RegisterMirror edc:cnameref="ADERRH" edc:cnamesuffix="M1"/>
      <edc:RegisterMirror edc:cnameref="ADSTPTL" edc:cnamesuffix="M1"/>
      <edc:RegisterMirror edc:cnameref="ADSTPTH" edc:cnamesuffix="M1"/>
      <edc:RegisterMirror edc:cnameref="ADFLTRL" edc:cnamesuffix="M1"/>
      <edc:RegisterMirror edc:cnameref="ADFLTRH" edc:cnamesuffix="M1"/>
      <edc:RegisterMirror edc:cnameref="ADACCL" edc:cnamesuffix="M1"/>
      <edc:RegisterMirror edc:cnameref="ADACCH" edc:cnamesuffix="M1"/>
      <edc:RegisterMirror edc:cnameref="ADACCU" edc:cnamesuffix="M1"/>
      <edc:RegisterMirror edc:cnameref="ADCNT" edc:cnamesuffix="M1"/>
      <edc:RegisterMirror edc:cnameref="ADRPT" edc:cnamesuffix="M1"/>
      <edc:RegisterMirror edc:cnameref="ADPREVL" edc:cnamesuffix="M1"/>
      <edc:RegisterMirror edc:cnameref="ADPREVH" edc:cnamesuffix="M1"/>
      <edc:RegisterMirror edc:cnameref="ADACQL" edc:cnamesuffix="M1"/>
      <edc:RegisterMirror edc:cnameref="ADACQH" edc:cnamesuffix="M1"/>
      <edc:RegisterMirror edc:cnameref="ADCAP" edc:cnamesuffix="M1"/>
      <edc:RegisterMirror edc:cnameref="ADPCH" edc:cnamesuffix="M1"/>
      <edc:RegisterMirror edc:cnameref="ADNCH" edc:cnamesuffix="M1"/>
      <edc:RegisterMirror edc:cnameref="ADRESL" edc:cnamesuffix="M1"/>
      <edc:RegisterMirror edc:cnameref="ADRESH" edc:cnamesuffix="M1"/>
    </edc:SFRDataSector>
    <edc:SFRDataSector edc:beginaddr="0x4100" edc:endaddr="0x4200" edc:regionid="sfr65">
      <edc:RegisterMirror edc:cnameref="DMAnBUF" edc:cnamesuffix="DMA1"/>
      <edc:RegisterMirror edc:cnameref="DMAnDCNTL" edc:cnamesuffix="DMA1"/>
      <edc:RegisterMirror edc:cnameref="DMAnDCNTH" edc:cnamesuffix="DMA1"/>
      <edc:RegisterMirror edc:cnameref="DMAnDPTRL" edc:cnamesuffix="DMA1"/>
      <edc:RegisterMirror edc:cnameref="DMAnDPTRH" edc:cnamesuffix="DMA1"/>
      <edc:RegisterMirror edc:cnameref="DMAnDSZL" edc:cnamesuffix="DMA1"/>
      <edc:RegisterMirror edc:cnameref="DMAnDSZH" edc:cnamesuffix="DMA1"/>
      <edc:RegisterMirror edc:cnameref="DMAnDSAL" edc:cnamesuffix="DMA1"/>
      <edc:RegisterMirror edc:cnameref="DMAnDSAH" edc:cnamesuffix="DMA1"/>
      <edc:RegisterMirror edc:cnameref="DMAnSCNTL" edc:cnamesuffix="DMA1"/>
      <edc:RegisterMirror edc:cnameref="DMAnSCNTH" edc:cnamesuffix="DMA1"/>
      <edc:RegisterMirror edc:cnameref="DMAnSPTRL" edc:cnamesuffix="DMA1"/>
      <edc:RegisterMirror edc:cnameref="DMAnSPTRH" edc:cnamesuffix="DMA1"/>
      <edc:RegisterMirror edc:cnameref="DMAnSPTRU" edc:cnamesuffix="DMA1"/>
      <edc:RegisterMirror edc:cnameref="DMAnSSZL" edc:cnamesuffix="DMA1"/>
      <edc:RegisterMirror edc:cnameref="DMAnSSZH" edc:cnamesuffix="DMA1"/>
      <edc:RegisterMirror edc:cnameref="DMAnSSAL" edc:cnamesuffix="DMA1"/>
      <edc:RegisterMirror edc:cnameref="DMAnSSAH" edc:cnamesuffix="DMA1"/>
      <edc:RegisterMirror edc:cnameref="DMAnSSAU" edc:cnamesuffix="DMA1"/>
      <edc:RegisterMirror edc:cnameref="DMAnCON0" edc:cnamesuffix="DMA1"/>
      <edc:RegisterMirror edc:cnameref="DMAnCON1" edc:cnamesuffix="DMA1"/>
      <edc:RegisterMirror edc:cnameref="DMAnAIRQ" edc:cnamesuffix="DMA1"/>
      <edc:RegisterMirror edc:cnameref="DMAnSIRQ" edc:cnamesuffix="DMA1"/>
      <edc:RegisterMirror edc:cnameref="DMAnBUF" edc:cnamesuffix="DMA2"/>
      <edc:RegisterMirror edc:cnameref="DMAnDCNTL" edc:cnamesuffix="DMA2"/>
      <edc:RegisterMirror edc:cnameref="DMAnDCNTH" edc:cnamesuffix="DMA2"/>
      <edc:RegisterMirror edc:cnameref="DMAnDPTRL" edc:cnamesuffix="DMA2"/>
      <edc:RegisterMirror edc:cnameref="DMAnDPTRH" edc:cnamesuffix="DMA2"/>
      <edc:RegisterMirror edc:cnameref="DMAnDSZL" edc:cnamesuffix="DMA2"/>
      <edc:RegisterMirror edc:cnameref="DMAnDSZH" edc:cnamesuffix="DMA2"/>
      <edc:RegisterMirror edc:cnameref="DMAnDSAL" edc:cnamesuffix="DMA2"/>
      <edc:RegisterMirror edc:cnameref="DMAnDSAH" edc:cnamesuffix="DMA2"/>
      <edc:RegisterMirror edc:cnameref="DMAnSCNTL" edc:cnamesuffix="DMA2"/>
      <edc:RegisterMirror edc:cnameref="DMAnSCNTH" edc:cnamesuffix="DMA2"/>
      <edc:RegisterMirror edc:cnameref="DMAnSPTRL" edc:cnamesuffix="DMA2"/>
      <edc:RegisterMirror edc:cnameref="DMAnSPTRH" edc:cnamesuffix="DMA2"/>
      <edc:RegisterMirror edc:cnameref="DMAnSPTRU" edc:cnamesuffix="DMA2"/>
      <edc:RegisterMirror edc:cnameref="DMAnSSZL" edc:cnamesuffix="DMA2"/>
      <edc:RegisterMirror edc:cnameref="DMAnSSZH" edc:cnamesuffix="DMA2"/>
      <edc:RegisterMirror edc:cnameref="DMAnSSAL" edc:cnamesuffix="DMA2"/>
      <edc:RegisterMirror edc:cnameref="DMAnSSAH" edc:cnamesuffix="DMA2"/>
      <edc:RegisterMirror edc:cnameref="DMAnSSAU" edc:cnamesuffix="DMA2"/>
      <edc:RegisterMirror edc:cnameref="DMAnCON0" edc:cnamesuffix="DMA2"/>
      <edc:RegisterMirror edc:cnameref="DMAnCON1" edc:cnamesuffix="DMA2"/>
      <edc:RegisterMirror edc:cnameref="DMAnAIRQ" edc:cnamesuffix="DMA2"/>
      <edc:RegisterMirror edc:cnameref="DMAnSIRQ" edc:cnamesuffix="DMA2"/>
      <edc:RegisterMirror edc:cnameref="DMAnBUF" edc:cnamesuffix="DMA3"/>
      <edc:RegisterMirror edc:cnameref="DMAnDCNTL" edc:cnamesuffix="DMA3"/>
      <edc:RegisterMirror edc:cnameref="DMAnDCNTH" edc:cnamesuffix="DMA3"/>
      <edc:RegisterMirror edc:cnameref="DMAnDPTRL" edc:cnamesuffix="DMA3"/>
      <edc:RegisterMirror edc:cnameref="DMAnDPTRH" edc:cnamesuffix="DMA3"/>
      <edc:RegisterMirror edc:cnameref="DMAnDSZL" edc:cnamesuffix="DMA3"/>
      <edc:RegisterMirror edc:cnameref="DMAnDSZH" edc:cnamesuffix="DMA3"/>
      <edc:RegisterMirror edc:cnameref="DMAnDSAL" edc:cnamesuffix="DMA3"/>
      <edc:RegisterMirror edc:cnameref="DMAnDSAH" edc:cnamesuffix="DMA3"/>
      <edc:RegisterMirror edc:cnameref="DMAnSCNTL" edc:cnamesuffix="DMA3"/>
      <edc:RegisterMirror edc:cnameref="DMAnSCNTH" edc:cnamesuffix="DMA3"/>
      <edc:RegisterMirror edc:cnameref="DMAnSPTRL" edc:cnamesuffix="DMA3"/>
      <edc:RegisterMirror edc:cnameref="DMAnSPTRH" edc:cnamesuffix="DMA3"/>
      <edc:RegisterMirror edc:cnameref="DMAnSPTRU" edc:cnamesuffix="DMA3"/>
      <edc:RegisterMirror edc:cnameref="DMAnSSZL" edc:cnamesuffix="DMA3"/>
      <edc:RegisterMirror edc:cnameref="DMAnSSZH" edc:cnamesuffix="DMA3"/>
      <edc:RegisterMirror edc:cnameref="DMAnSSAL" edc:cnamesuffix="DMA3"/>
      <edc:RegisterMirror edc:cnameref="DMAnSSAH" edc:cnamesuffix="DMA3"/>
      <edc:RegisterMirror edc:cnameref="DMAnSSAU" edc:cnamesuffix="DMA3"/>
      <edc:RegisterMirror edc:cnameref="DMAnCON0" edc:cnamesuffix="DMA3"/>
      <edc:RegisterMirror edc:cnameref="DMAnCON1" edc:cnamesuffix="DMA3"/>
      <edc:RegisterMirror edc:cnameref="DMAnAIRQ" edc:cnamesuffix="DMA3"/>
      <edc:RegisterMirror edc:cnameref="DMAnSIRQ" edc:cnamesuffix="DMA3"/>
      <edc:RegisterMirror edc:cnameref="DMAnBUF" edc:cnamesuffix="DMA4"/>
      <edc:RegisterMirror edc:cnameref="DMAnDCNTL" edc:cnamesuffix="DMA4"/>
      <edc:RegisterMirror edc:cnameref="DMAnDCNTH" edc:cnamesuffix="DMA4"/>
      <edc:RegisterMirror edc:cnameref="DMAnDPTRL" edc:cnamesuffix="DMA4"/>
      <edc:RegisterMirror edc:cnameref="DMAnDPTRH" edc:cnamesuffix="DMA4"/>
      <edc:RegisterMirror edc:cnameref="DMAnDSZL" edc:cnamesuffix="DMA4"/>
      <edc:RegisterMirror edc:cnameref="DMAnDSZH" edc:cnamesuffix="DMA4"/>
      <edc:RegisterMirror edc:cnameref="DMAnDSAL" edc:cnamesuffix="DMA4"/>
      <edc:RegisterMirror edc:cnameref="DMAnDSAH" edc:cnamesuffix="DMA4"/>
      <edc:RegisterMirror edc:cnameref="DMAnSCNTL" edc:cnamesuffix="DMA4"/>
      <edc:RegisterMirror edc:cnameref="DMAnSCNTH" edc:cnamesuffix="DMA4"/>
      <edc:RegisterMirror edc:cnameref="DMAnSPTRL" edc:cnamesuffix="DMA4"/>
      <edc:RegisterMirror edc:cnameref="DMAnSPTRH" edc:cnamesuffix="DMA4"/>
      <edc:RegisterMirror edc:cnameref="DMAnSPTRU" edc:cnamesuffix="DMA4"/>
      <edc:RegisterMirror edc:cnameref="DMAnSSZL" edc:cnamesuffix="DMA4"/>
      <edc:RegisterMirror edc:cnameref="DMAnSSZH" edc:cnamesuffix="DMA4"/>
      <edc:RegisterMirror edc:cnameref="DMAnSSAL" edc:cnamesuffix="DMA4"/>
      <edc:RegisterMirror edc:cnameref="DMAnSSAH" edc:cnamesuffix="DMA4"/>
      <edc:RegisterMirror edc:cnameref="DMAnSSAU" edc:cnamesuffix="DMA4"/>
      <edc:RegisterMirror edc:cnameref="DMAnCON0" edc:cnamesuffix="DMA4"/>
      <edc:RegisterMirror edc:cnameref="DMAnCON1" edc:cnamesuffix="DMA4"/>
      <edc:RegisterMirror edc:cnameref="DMAnAIRQ" edc:cnamesuffix="DMA4"/>
      <edc:RegisterMirror edc:cnameref="DMAnSIRQ" edc:cnamesuffix="DMA4"/>
      <edc:AdjustPoint edc:offset="0x84"/>
      <edc:RegisterMirror edc:cnameref="IOCAF" edc:cnamesuffix="M1"/>
      <edc:RegisterMirror edc:cnameref="IOCBF" edc:cnamesuffix="M1"/>
      <edc:RegisterMirror edc:cnameref="IOCCF" edc:cnamesuffix="M1"/>
      <edc:RegisterMirror edc:cnameref="IOCEF" edc:cnamesuffix="M1"/>
      <edc:RegisterMirror edc:cnameref="IOCWF" edc:cnamesuffix="M1"/>
      <edc:AdjustPoint edc:offset="0x0B"/>
      <edc:RegisterMirror edc:cnameref="TU16APRL" edc:cnamesuffix="M1"/>
